Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ОбменМатериаламиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="9bc99607-c6e6-435f-9cd6-d09156ac3541">
  <name>ОбменМатериаламиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакетаДанных</name>
    <type>
      <types>EnumRef.ТипыПакетовДанныхСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПакетДляЭкспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеДоДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеПослеДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьТолькоПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИмпортированныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИмпортИзКаталогаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыДляЭкспорта</name>
    <attributes>
      <name>СсылкаНаЭлемент</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПакетыДанных</name>
    <attributes>
      <name>НомерПакетаДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПакетДанных</name>
      <type>
        <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Examinator/src/Enums/ТипыПакетовДанныхСУЗ/ТипыПакетовДанныхСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПакетовДанныхСУЗ</name>
  <enumValues>
    <name>XML_V8</name>
  </enumValues>
  <enumValues>
    <name>SCORM_2004</name>
  </enumValues>
  <enumValues>
    <name>E4HOME</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ТипПакетаДанных) Тогда
		ТипПакетаДанных = Перечисления.ТипыПакетовДанныхСУЗ.XML_V8;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	НомерРедакции = ?(НомерРедакции = 0, 1, НомерРедакции);
	
КонецПроцедуры
